analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/spixr_regs.h
#define MXC_F_SPIXR_IRQ_TX_EMPTY_POS                   1 /**< IRQ_TX_EMPTY Position */
#define MXC_F_SPIXR_IRQ_TX_EMPTY                       ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_TX_EMPTY_POS)) /**< IRQ_TX_EMPTY Mask */

#define MXC_F_SPIXR_IRQ_RX_THRESH_POS                  2 /**< IRQ_RX_THRESH Position */
#define MXC_F_SPIXR_IRQ_RX_THRESH                      ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_RX_THRESH_POS)) /**< IRQ_RX_THRESH Mask */

#define MXC_F_SPIXR_IRQ_RX_FULL_POS                    3 /**< IRQ_RX_FULL Position */
#define MXC_F_SPIXR_IRQ_RX_FULL                        ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_RX_FULL_POS)) /**< IRQ_RX_FULL Mask */

#define MXC_F_SPIXR_IRQ_SSA_POS                        4 /**< IRQ_SSA Position */
#define MXC_F_SPIXR_IRQ_SSA                            ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_SSA_POS)) /**< IRQ_SSA Mask */

#define MXC_F_SPIXR_IRQ_SSD_POS                        5 /**< IRQ_SSD Position */
#define MXC_F_SPIXR_IRQ_SSD                            ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_SSD_POS)) /**< IRQ_SSD Mask */

#define MXC_F_SPIXR_IRQ_FAULT_POS                      8 /**< IRQ_FAULT Position */
#define MXC_F_SPIXR_IRQ_FAULT                          ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_FAULT_POS)) /**< IRQ_FAULT Mask */

#define MXC_F_SPIXR_IRQ_ABORT_POS                      9 /**< IRQ_ABORT Position */
#define MXC_F_SPIXR_IRQ_ABORT                          ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_ABORT_POS)) /**< IRQ_ABORT Mask */

#define MXC_F_SPIXR_IRQ_M_DONE_POS                     11 /**< IRQ_M_DONE Position */
#define MXC_F_SPIXR_IRQ_M_DONE                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_M_DONE_POS)) /**< IRQ_M_DONE Mask */

#define MXC_F_SPIXR_IRQ_TX_OVR_POS                     12 /**< IRQ_TX_OVR Position */
#define MXC_F_SPIXR_IRQ_TX_OVR                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_TX_OVR_POS)) /**< IRQ_TX_OVR Mask */

#define MXC_F_SPIXR_IRQ_TX_UND_POS                     13 /**< IRQ_TX_UND Position */
#define MXC_F_SPIXR_IRQ_TX_UND                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_TX_UND_POS)) /**< IRQ_TX_UND Mask */

#define MXC_F_SPIXR_IRQ_RX_OVR_POS                     14 /**< IRQ_RX_OVR Position */
#define MXC_F_SPIXR_IRQ_RX_OVR                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_RX_OVR_POS)) /**< IRQ_RX_OVR Mask */

#define MXC_F_SPIXR_IRQ_RX_UND_POS                     15 /**< IRQ_RX_UND Position */
#define MXC_F_SPIXR_IRQ_RX_UND                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQ_RX_UND_POS)) /**< IRQ_RX_UND Mask */

/**@} end of group SPIXR_IRQ_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_IRQE SPIXR_IRQE
 * @brief    Register for enabling interrupts.
 * @{
 */
#define MXC_F_SPIXR_IRQE_TX_THRESH_POS                 0 /**< IRQE_TX_THRESH Position */
#define MXC_F_SPIXR_IRQE_TX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_TX_THRESH_POS)) /**< IRQE_TX_THRESH Mask */

#define MXC_F_SPIXR_IRQE_TX_EMPTY_POS                  1 /**< IRQE_TX_EMPTY Position */
#define MXC_F_SPIXR_IRQE_TX_EMPTY                      ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_TX_EMPTY_POS)) /**< IRQE_TX_EMPTY Mask */

#define MXC_F_SPIXR_IRQE_RX_THRESH_POS                 2 /**< IRQE_RX_THRESH Position */
#define MXC_F_SPIXR_IRQE_RX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_RX_THRESH_POS)) /**< IRQE_RX_THRESH Mask */

#define MXC_F_SPIXR_IRQE_RX_FULL_POS                   3 /**< IRQE_RX_FULL Position */
#define MXC_F_SPIXR_IRQE_RX_FULL                       ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_RX_FULL_POS)) /**< IRQE_RX_FULL Mask */

#define MXC_F_SPIXR_IRQE_SSA_POS                       4 /**< IRQE_SSA Position */
#define MXC_F_SPIXR_IRQE_SSA                           ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_SSA_POS)) /**< IRQE_SSA Mask */

#define MXC_F_SPIXR_IRQE_SSD_POS                       5 /**< IRQE_SSD Position */
#define MXC_F_SPIXR_IRQE_SSD                           ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_SSD_POS)) /**< IRQE_SSD Mask */

#define MXC_F_SPIXR_IRQE_FAULT_POS                     8 /**< IRQE_FAULT Position */
#define MXC_F_SPIXR_IRQE_FAULT                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_FAULT_POS)) /**< IRQE_FAULT Mask */

#define MXC_F_SPIXR_IRQE_ABORT_POS                     9 /**< IRQE_ABORT Position */
#define MXC_F_SPIXR_IRQE_ABORT                         ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_ABORT_POS)) /**< IRQE_ABORT Mask */

#define MXC_F_SPIXR_IRQE_M_DONE_POS                    11 /**< IRQE_M_DONE Position */
#define MXC_F_SPIXR_IRQE_M_DONE                        ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_M_DONE_POS)) /**< IRQE_M_DONE Mask */

#define MXC_F_SPIXR_IRQE_TX_OVR_POS                    12 /**< IRQE_TX_OVR Position */
#define MXC_F_SPIXR_IRQE_TX_OVR                        ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_TX_OVR_POS)) /**< IRQE_TX_OVR Mask */

#define MXC_F_SPIXR_IRQE_TX_UND_POS                    13 /**< IRQE_TX_UND Position */
#define MXC_F_SPIXR_IRQE_TX_UND                        ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_TX_UND_POS)) /**< IRQE_TX_UND Mask */

#define MXC_F_SPIXR_IRQE_RX_OVR_POS                    14 /**< IRQE_RX_OVR Position */
#define MXC_F_SPIXR_IRQE_RX_OVR                        ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_RX_OVR_POS)) /**< IRQE_RX_OVR Mask */

#define MXC_F_SPIXR_IRQE_RX_UND_POS                    15 /**< IRQE_RX_UND Position */
#define MXC_F_SPIXR_IRQE_RX_UND                        ((uint32_t)(0x1UL << MXC_F_SPIXR_IRQE_RX_UND_POS)) /**< IRQE_RX_UND Mask */

/**@} end of group SPIXR_IRQE_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_WAKE SPIXR_WAKE
 * @brief    Register for wake up flags. All bits in this register are write 1 to clear.
 * @{
 */
#define MXC_F_SPIXR_WAKE_TX_THRESH_POS                 0 /**< WAKE_TX_THRESH Position */
#define MXC_F_SPIXR_WAKE_TX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_TX_THRESH_POS)) /**< WAKE_TX_THRESH Mask */

#define MXC_F_SPIXR_WAKE_TX_EMPTY_POS                  1 /**< WAKE_TX_EMPTY Position */
#define MXC_F_SPIXR_WAKE_TX_EMPTY                      ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_TX_EMPTY_POS)) /**< WAKE_TX_EMPTY Mask */

