analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/spixr_regs.h
#define MXC_F_SPIXR_WAKE_RX_THRESH_POS                 2 /**< WAKE_RX_THRESH Position */
#define MXC_F_SPIXR_WAKE_RX_THRESH                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_RX_THRESH_POS)) /**< WAKE_RX_THRESH Mask */

#define MXC_F_SPIXR_WAKE_RX_FULL_POS                   3 /**< WAKE_RX_FULL Position */
#define MXC_F_SPIXR_WAKE_RX_FULL                       ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKE_RX_FULL_POS)) /**< WAKE_RX_FULL Mask */

/**@} end of group SPIXR_WAKE_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_WAKEE SPIXR_WAKEE
 * @brief    Register for wake up enable.
 * @{
 */
#define MXC_F_SPIXR_WAKEE_TX_THRESH_POS                0 /**< WAKEE_TX_THRESH Position */
#define MXC_F_SPIXR_WAKEE_TX_THRESH                    ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKEE_TX_THRESH_POS)) /**< WAKEE_TX_THRESH Mask */

#define MXC_F_SPIXR_WAKEE_TX_EMPTY_POS                 1 /**< WAKEE_TX_EMPTY Position */
#define MXC_F_SPIXR_WAKEE_TX_EMPTY                     ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKEE_TX_EMPTY_POS)) /**< WAKEE_TX_EMPTY Mask */

#define MXC_F_SPIXR_WAKEE_RX_THRESH_POS                2 /**< WAKEE_RX_THRESH Position */
#define MXC_F_SPIXR_WAKEE_RX_THRESH                    ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKEE_RX_THRESH_POS)) /**< WAKEE_RX_THRESH Mask */

#define MXC_F_SPIXR_WAKEE_RX_FULL_POS                  3 /**< WAKEE_RX_FULL Position */
#define MXC_F_SPIXR_WAKEE_RX_FULL                      ((uint32_t)(0x1UL << MXC_F_SPIXR_WAKEE_RX_FULL_POS)) /**< WAKEE_RX_FULL Mask */

/**@} end of group SPIXR_WAKEE_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_STAT SPIXR_STAT
 * @brief    SPI Status register.
 * @{
 */
#define MXC_F_SPIXR_STAT_BUSY_POS                      0 /**< STAT_BUSY Position */
#define MXC_F_SPIXR_STAT_BUSY                          ((uint32_t)(0x1UL << MXC_F_SPIXR_STAT_BUSY_POS)) /**< STAT_BUSY Mask */

/**@} end of group SPIXR_STAT_Register */

/**
 * @ingroup  spixr_registers
 * @defgroup SPIXR_XMEM_CTRL SPIXR_XMEM_CTRL
 * @brief    Register to control external memory.
 * @{
 */
#define MXC_F_SPIXR_XMEM_CTRL_RD_CMD_POS               0 /**< XMEM_CTRL_RD_CMD Position */
#define MXC_F_SPIXR_XMEM_CTRL_RD_CMD                   ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEM_CTRL_RD_CMD_POS)) /**< XMEM_CTRL_RD_CMD Mask */

#define MXC_F_SPIXR_XMEM_CTRL_WR_CMD_POS               8 /**< XMEM_CTRL_WR_CMD Position */
#define MXC_F_SPIXR_XMEM_CTRL_WR_CMD                   ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEM_CTRL_WR_CMD_POS)) /**< XMEM_CTRL_WR_CMD Mask */

#define MXC_F_SPIXR_XMEM_CTRL_DUMMY_CLK_POS            16 /**< XMEM_CTRL_DUMMY_CLK Position */
#define MXC_F_SPIXR_XMEM_CTRL_DUMMY_CLK                ((uint32_t)(0xFFUL << MXC_F_SPIXR_XMEM_CTRL_DUMMY_CLK_POS)) /**< XMEM_CTRL_DUMMY_CLK Mask */

#define MXC_F_SPIXR_XMEM_CTRL_XMEM_EN_POS              31 /**< XMEM_CTRL_XMEM_EN Position */
#define MXC_F_SPIXR_XMEM_CTRL_XMEM_EN                  ((uint32_t)(0x1UL << MXC_F_SPIXR_XMEM_CTRL_XMEM_EN_POS)) /**< XMEM_CTRL_XMEM_EN Mask */

/**@} end of group SPIXR_XMEM_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32665_INCLUDE_SPIXR_REGS_H_
